import tensorflow as tf

#OR Data 구축
x = [ [0.0,0.0], [0.0,1.0], [1.0,0.0], [1.0,1.0] ]
y = [ [-1], [1], [1], [1] ]

#4-1에서 사이킷런으로 학습된 퍼셉트론으로 계산된 weight와 bias 적용
w = tf.Variable( [[2.0], [2.0]] ) #교재에는 [1.0], [1.0]
b = tf.Variable(-1.0)             #교재에는 (-0.5)

#퍼셉트론 동작
s = tf.add(tf.matmul(x, w), b) #퍼셉트론의 행렬 연산. matmul : 곱셈, add : 덧셈
o = tf.sign(s)                 #양수이면 1, 음수이면 -1, 0이면 0을 리턴하는 함수로 활성함수 역할.

print(s) #[ [-1.] [1.] [1.] [3.] ] #교재의 1, 1, -0.5 입력일 경우 [[-0.5] [0.5] [0.5] [1.5]]
print(o) #[ [-1.] [1.] [1.] [1.] ]